Documents/абс_СводнаяЗаявкаНаТранспорт/абс_СводнаяЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СводнаяЗаявкаНаТранспорт</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Enums/абс_СтатусыЗаявокНаТранспорт/абс_СтатусыЗаявокНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаТранспорт</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КИсполнению</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_СводнаяЗаявкаНаТранспорт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоЗаявкам(Команда)
	
	Если Объект.Маршруты.Количество() > 0 
		И Вопрос("Заполнить табличную часть по заявкам на транспорт?" + Символы.ПС + 
		"Существующие строки будут очищены.",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМаршрутыПоЗаявкам_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМаршрутыПоЗаявкам_Сервер()
	
	Объект.Маршруты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_ЗаявкаНаТранспорт.Ссылка КАК ЗаявкаНаТранспорт,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Контрагент КАК Контрагент,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ОтветственныйМенеджер КАК Менеджер,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.КонтактыОтветственногоМенеджера КАК КонтактыМенеджера,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Склад КАК Склад,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоОбъем КАК ОбъемПоЗаявке,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоВес КАК ВесПоЗаявке,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоКоличествоПалет КАК КоличествоПалетПоЗаявке,
	               |	СУММА(абс_ЗаявкаНаТранспорт.Сумма) КАК СуммаПоЗаявке,
	               |	ВЫРАЗИТЬ(абс_ЗаявкаНаТранспорт.Ссылка.Комментарий КАК СТРОКА(300)) КАК Комментарий
	               |ИЗ
	               |	Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспорт
	               |ГДЕ
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ПланируемаяДатаОтгрузки <= &ПланируемаяДатаОтгрузки
	               |	И абс_ЗаявкаНаТранспорт.Ссылка.Статус = &Статус
	               |	И абс_ЗаявкаНаТранспорт.Ссылка.Проведен
	               |	И ВЫБОР
	               |			КОГДА НЕ ЕСТЬNULL(абс_ЗаявкаНаТранспорт.Ссылка.ЗаказПокупателя.ДоговорКонтрагента.ВидВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.ПустаяСсылка)
	               |				ТОГДА НЕ абс_ЗаявкаНаТранспорт.Ссылка.ЗаказПокупателя.ДоговорКонтрагента.ВидВзаиморасчетов.абс_НеЯвляетсяПродажей
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	абс_ЗаявкаНаТранспорт.Ссылка,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Контрагент,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ОтветственныйМенеджер,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.КонтактыОтветственногоМенеджера,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Склад,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоОбъем,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоВес,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.ВсегоКоличествоПалет,
	               |	ВЫРАЗИТЬ(абс_ЗаявкаНаТранспорт.Ссылка.Комментарий КАК СТРОКА(300))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Склад,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.Организация,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.АдресПромежуточный,
	               |	абс_ЗаявкаНаТранспорт.Ссылка.АдресКонтрагента";
	
	Запрос.УстановитьПараметр("ПланируемаяДатаОтгрузки",КонецДня(Объект.ДатаИсполнения));
	Запрос.УстановитьПараметр("Статус",Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Маршруты.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМаршрут(Команда)
	
	Если Элементы.Маршруты.ВыделенныеСтроки.Количество()=0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выделено ни одной заявки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Вопрос("Перед формированием маршрута документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать(Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный));
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Вопрос("Сформировать маршрут по выделенным заявкам?",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьТранспортныйМаршрут_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТранспортныйМаршрут_Сервер()
	
//	Записать(Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный));
	
	Отказ = Ложь;
	
	Для Каждого ЭлМассива ИЗ Элементы.Маршруты.ВыделенныеСтроки Цикл
		ТекСтрока = Объект.Маршруты.НайтиПоИдентификатору(ЭлМассива);
		Если ЗначениеЗаполнено(ТекСтрока.ТранспортныйМаршрут) Тогда
			Сообщить("В строке " + Строка(ЭлМассива+1) + " уже указан маршрут!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДокМаршрут = Документы.абс_ТранспортныйМаршрут.СоздатьДокумент();
	ДокМаршрут.Дата                     	= Объект.Дата;
	ДокМаршрут.СводнаяЗаявкаНаТранспорт 	= Объект.Ссылка;
	ДокМаршрут.Статус 						= Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
	ДокМаршрут.Ответственный 				= ПараметрыСеанса.ТекущийПользователь;
	
	//{Лео Катанович
	//Если Объект.Маршруты.Количество()>0 Тогда
	//	ДокМаршрут.Организация 				= Объект.Маршруты[0].ЗаявкаНаТранспорт.Организация;
	//Иначе
	//	ДокМаршрут.Организация 				= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ДокМаршрут.Ответственный, "ОсновнаяОрганизация");
	//КонецЕсли;
	//Лео Катанович}
	
	//нужна согласованная запись транспортного маршрута и заявок на транспорт
	НачатьТранзакцию();
	
	Для Каждого ЭлМассива ИЗ Элементы.Маршруты.ВыделенныеСтроки Цикл
		ТекСтрока = Объект.Маршруты.НайтиПоИдентификатору(ЭлМассива);
		НоваяСтрока = ДокМаршрут.Задания.Добавить();
		НоваяСтрока.ЗаявкаНаТранспорт = ТекСтрока.ЗаявкаНаТранспорт;
		
		//обновить статус в заявке на транспорт
		ДокЗаявкаОбъект = ТекСтрока.ЗаявкаНаТранспорт.ПолучитьОбъект();
		ДокЗаявкаОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Исполнение;
		
		//{Лео Катанович
		ДокМаршрут.Организация = ДокЗаявкаОбъект.Организация;
		
		//Лео Катанович}
		
		Попытка
			ДокЗаявкаОбъект.Записать();
		Исключение
			Сообщить(Строка(ДокЗаявкаОбъект) + " не записан! " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Попытка
		ДокМаршрут.Записать();
	Исключение
		Сообщить("По сводной заявке '" + СокрЛП(Объект.Номер) + " от " + Формат(Объект.Дата,"ДДММГГГГ") + " транспортный маршрут не сформирован! "
		+ ОписаниеОшибки(),СтатусСообщения.Важное);
		Отказ = Истина;
	КонецПопытки;
	
	Если Не Отказ Тогда
		//в текущей сводной заявке пропишем сформированные маршруты
		Для Каждого ЭлМассива ИЗ Элементы.Маршруты.ВыделенныеСтроки Цикл
			ТекСтрока = Объект.Маршруты.НайтиПоИдентификатору(ЭлМассива);
			ТекСтрока.ТранспортныйМаршрут = ДокМаршрут.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Записать(Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный));
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаИсполнения) Тогда
		Объект.ДатаИсполнения = Объект.Дата;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеТЧ();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СводнаяЗаявкаНаТранспорт")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	П=Новый Структура("СводнаяЗаявкаНаТранспорт",Объект.Ссылка);
	Форма=ПолучитьФорму("Обработка.абс_ГрупповаяПечатьДокументов.Форма.Форма",П,ЭтаФорма);
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура УстановитьУсловноеОформлениеТЧ()
	
	СписокТМ = Новый СписокЗначений;
	Для каждого СтрокаТЧ из Объект.Маршруты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ТранспортныйМаршрут.ТранспортноеСредство) Тогда
			СписокТМ.Добавить(СтрокаТЧ.ТранспортныйМаршрут);
		КонецЕсли;
	КонецЦикла;
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Маршруты");

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Маршруты.ТранспортныйМаршрут");
	ЭлементОтбора.ПравоеЗначение = СписокТМ;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СводнаяЗаявкаНаТранспорт")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокумент(Команда)
	ОбновитьДокументСервер();
КонецПроцедуры

&НаСервере 
Процедура ОбновитьДокументСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ЗаявкаНаТранспорт.Ссылка КАК ЗаявкаНаТранспорт,
	|	ЕСТЬNULL(абс_ТранспортныйМаршрутЗадания.Ссылка, ЗНАЧЕНИЕ(Документ.абс_ТранспортныйМаршрут.ПустаяСсылка)) КАК ТранспортныйМаршрут
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|		ПО абс_ЗаявкаНаТранспорт.Ссылка = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ЗаявкаНаТранспорт.Ссылка.ПланируемаяДатаОтгрузки <= &ПланируемаяДатаОтгрузки
	|	И абс_ЗаявкаНаТранспорт.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыЗаявокНаТранспорт.КИсполнению)
	|	И абс_ЗаявкаНаТранспорт.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(абс_ЗаявкаНаТранспорт.Ссылка.ЗаказПокупателя.ДоговорКонтрагента.ВидВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.ПустаяСсылка)
	|				ТОГДА НЕ абс_ЗаявкаНаТранспорт.Ссылка.ЗаказПокупателя.ДоговорКонтрагента.ВидВзаиморасчетов.абс_НеЯвляетсяПродажей
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_ЗаявкаНаТранспорт.Ссылка,
	|	ЕСТЬNULL(абс_ТранспортныйМаршрутЗадания.Ссылка, ЗНАЧЕНИЕ(Документ.абс_ТранспортныйМаршрут.ПустаяСсылка))";	
	
	Запрос.УстановитьПараметр("ПланируемаяДатаОтгрузки", КонецДня(ЭтотОбъект.ДатаИсполнения));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ЭтотОбъект.Маршруты.Найти(Выборка.ЗаявкаНаТранспорт, "ЗаявкаНаТранспорт");
		Если СтрокаТабличнойЧасти = Неопределено Тогда
			НоваяСтрока = ЭтотОбъект.Маршруты.Добавить();
			НоваяСтрока.ЗаявкаНаТранспорт = Выборка.ЗаявкаНаТранспорт;
			НоваяСтрока.Комментарий = Выборка.ЗаявкаНаТранспорт.Комментарий;
		Иначе
			СтрокаТабличнойЧасти.ТранспортныйМаршрут = Выборка.ТранспортныйМаршрут;
		КонецЕсли;
	КонецЦикла;
	МассивСтрок = Новый Массив;	
	Для каждого СтрокаТЧ Из ЭтотОбъект.Маршруты Цикл
		Если СтрокаТЧ.ЗаявкаНаТранспорт.ПланируемаяДатаОтгрузки>=КонецДня(ЭтотОбъект.ДатаИсполнения) И Не ЗначениеЗаполнено(СтрокаТЧ.ТранспортныйМаршрут) Тогда
			МассивСтрок.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ из МассивСтрок Цикл
		ЭтотОбъект.Маршруты.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ЭтотОбъект.Маршруты.Сортировать("ТранспортныйМаршрут, ЗаявкаНаТранспорт");
	
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыТранспортныйМаршрутНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Документ.абс_ТранспортныйМаршрут.ФормаВыбора",,Элемент);
	
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НачалоДня(Объект.ДатаИсполнения);
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = КонецДня(Объект.ДатаИсполнения);
	ЭлементОтбора.Использование = Истина;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры
